# For DrawBot 
# Use it with these files installed:
# Eczar-ExtraBold_170702.ufo

size("A4Landscape")
font("Eczar Regular_170702")
fontSize(42)
tracking(20)

textBox("ΑΆἈἉἊἋἌἍἎἏᾸᾹᾺΆᾈᾉᾊᾋᾌᾍᾎᾏᾼΒΓΔΕΈἘἙἚἛἜἝῈΈΖΗΉἨἩἪἫἬἭἮἯῊΉᾘᾙᾚᾛᾜᾝᾞᾟῌΘΙΊΪἸἹἺἻἼἽἾἿῘῙῚΊΚΛΜΝΞΟΌὈὉὊὋὌὍῸΌΠΡῬΣΤΥΎΫὙὛὝὟῨῩῪΎΦΧΨΩΏὨὩὪὫὬὭὮὯῺΏᾨᾩᾪᾫᾬᾭᾮᾯῼ", (30, -30, width()-100, height()))

fill(0.5)
fontSize(9)
tracking(0)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170702 / Uppercase with Basic Polytonic / TestPrintDoc170702 / p1|4", (30, 10, width(), 30), align="left")

newPage("A4Landscape")
font("Eczar Regular_170702")

fontSize(42)
tracking(20)

textBox("αάἀἁἂἃἄἅἆἇὰάᾀᾁᾂᾃᾄᾅᾆᾇᾰᾱᾲᾳᾴᾶᾷβγδεέἐἑἒἓἔἕὲέζηήἠἡἢἣἤἥἦἧὴήᾐᾑᾒᾓᾔᾕᾖᾗῂῃῄῆῇθιΐίϊἰἱἲἳἴἵἶἷὶίῐῑῒΐῖῗκλμνξοόὀὁὂὃὄὅὸόπρῤῥςστυΰϋύὐὑὒὓὔὕὖὗὺύῠῡῢΰῦῧφχψωώὠὡὢὣὤὥὦὧὼᾠᾡᾢᾣᾤᾥᾦᾧῲῳῴῶῷώ", (30, -30, width()-100, height()))

fill(0.5)
fontSize(9)
tracking(0)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170702 / Lowercase with Basic Polytonic / TestPrintDoc170702 / p2|4", (30, 10, width(), 30), align="left")

newPage("A4Landscape")

font("Eczar Regular_170702")
lineHeight(12)
language("Greek")
hyphenation(True)

TestText = '''
Τελευταῖον ἐπῆρε καὶ τὸν ἄνδρα της, καὶ τῆς εἶχον μείνει μόνον δύο υἱοί, ξενιτευμένοι τώρα· ὁ εἷς εἶχεν ὑπάγει, τῆς εἶπον, εἰς τὴν Αὐστραλίαν, καὶ δὲν εἶχε στείλει γράμμα ἀπὸ τριῶν ἐτῶν· αὐτὴ δὲν ἤξευρε τί εἶχεν ἀπογίνει· ὁ ἄλλος ὁ μικρότερος ἐταξίδευε μὲ τὰ καράβια ἐντὸς τῆς Μεσογείου, καὶ κάποτε τὴν ἐνθυμεῖτο ἀκόμη. Τῆς εἶχε μείνει καὶ μία κόρη, ὑπανδρευμένη τώρα, μὲ μισὴν δωδεκάδα παιδιά.

Πλησίον αὐτῆς, ἡ γρια-Λούκαινα ἐθήτευε τώρα, εἰς τὸ γῆράς της, καὶ δι᾿ αὐτὴν ἐπήγαινε τὸν κατήφορον, τὸ μονοπάτι, διὰ νὰ πλύνῃ τὰ χράμια καὶ ἄλλα διάφορα σκουτιὰ εἰς τὸ κῦμα τὸ ἁλμυρόν, καὶ νὰ τὰ ξεγλυκάνῃ στὸ Γλυφονέρι.

Ἡ γραῖα ἔκυψεν εἰς τὴν ἄκρην χθαμαλοῦ, θαλασσοφαγωμένου βράχου, καὶ ἤρχισε νὰ πλύνῃ τὰ ροῦχα. Δεξιά της κατήρχετο ὁμαλώτερος, πλαγιαστός, ὁ κρημνὸς τοῦ γηλόφου, ἐφ᾿ οὗ ἦτο τὸ Κοιμητήριον, καὶ εἰς τὰ κλίτη τοῦ ὁποίου ἐκυλίοντο ἀενάως πρὸς τὴν θάλασσαν τὴν πανδέγμονα τεμάχια σαπρῶν ξύλων ἀπὸ ξεχώματα, ἤτοι ἀνακομιδὰς ἀνθρωπίνων σκελετῶν, λείψανα ἀπὸ χρυσὲς γόβες ἢ χρυσοκέντητα ὑποκάμισα νεαρῶν γυναικῶν, συνταφέντα ποτὲ μαζί των, βόστρυχοι ἀπὸ κόμας ξανθάς, καὶ ἄλλα τοῦ θανάτου λάφυρα. Ὑπεράνω τῆς κεφαλῆς της, ὀλίγον πρὸς τὰ δεξιά, ἐντὸς μικρᾶς κρυπτῆς λάκκας, παραπλεύρως τοῦ Κοιμητηρίου, εἶχε καθίσει νεαρὸς βοσκός, ἐπιστρέφων μὲ τὸ μικρὸν κοπάδι του ἀπὸ τοὺς ἀγρούς, καί, χωρὶς ν᾿ ἀναλογισθῇ τὸ πένθιμον τοῦ τόπου, εἶχε βγάλει τὸ σουραύλι ἀπὸ τὸ μαρσίπιόν του, καὶ ἤρχισε νὰ μέλπῃ φαιδρὸν ποιμενικὸν ᾆσμα. Τὸ μυρολόγι τῆς γραίας ἐκόπασεν εἰς τὸν θόρυβον τοῦ αὐλοῦ, καὶ οἱ ἐπιστρέφοντες ἀπὸ τοὺς ἀγροὺς τὴν ὥραν ἐκείνην ―εἶχε δύσει ἐν τῷ μεταξὺ ὁ ἥλιος― ἤκουον μόνον τὴν φλογέραν, κ᾿ ἐκοίταζον νὰ ἴδωσι ποῦ ἦτο ὁ αὐλητής, ὅστις δὲν ἐφαίνετο, κρυμμένος μεταξὺ τῶν...'''


textBox(TestText, (30, -10, 227, height()))

fontSize(14)
lineHeight(16)


textBox(TestText, (300, height()/2-4, 500, height()/2))

fontSize(20)
lineHeight(23)

textBox(TestText, (300, height()/2-250, 500, 250))   

fill(0.5)
fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170702 / TestPrintDoc170702 / Sample text: “The Seal’s Dirge” - A. Papadiamantis / p3|4 ", (30, 10, width(), 30), align="left")

newPage("A4Landscape")

font("Eczar Regular_170702")
lineHeight(12)
language("Greek")
hyphenation(True)

TestText = '''
Δημήτριος Δαμιλας υπήρξε από τους σημαντικότερους πρωτεργάτες της ελληνικής τυπογραφίας και το πρώτο ελληνικό χρονολογημένο βιβλίο τυπώθηκε με τη δική του επιστασία. γεννήθηκε στην κρήτη, ΑΔΕΛΦΟΣ ΤΟΥ ΚΩΔΙΚΟΓΡΑΦΟΥ ΚΑΙ ΝΟΤΑΡΙΟΥ ΤΟΥ ΧΑΝΔΑΚΑ ΑΝΤΩΝΙΟΥ, αναφέρεται ως «Δημήτριος ο Κρης», ωστόσο οι γονείς του κατάγονταν από το Μιλάνο. Δεν γνωρίζουμε τίποτα σχετικά με την παιδεία και τους δασκάλους του, παρά μόνο ότι εξάσκησε στην Ιταλία, παράλληλα με τις τυπογραφικές του δραστηριότητες και την κωδικογραφία. Η διατριβή του Δαμιλά στα ιταλικά πνευματικά κέντρα αρχίζει στη γενέτειρα της οικογένειας του το Μιλάνο (π. 1475- πριν από το 1484), ενώ στη συνέχεια εγκαθίσταται στη Φλωρεντία ως περίπου το 1490 και από τότε τον βρίσκουμε στη Ρώμη όπου ίσως ζούσε ακόμη το 1510. Στο Μιλάνο, αρχικά, συνεργάσθηκε με τον Ιταλό Dionigi Parravicino για την έκδοση της Επιτομής των οκτώ του λόγου μερών του Κωνσταντίνου Λάσκαρη. Η ΓΡΑΜΜΑΤΙΚΗ ΤΟΥ ΚΩΝΣΤΑΝΤΙΝΟΥ ΛΑΣΚΑΡΗ ΕΙΝΑΙ ΤΟ ΔΕΥΤΕΡΟ ΓΡΑΜΜΑΤΙΚΟ ΕΓΧΕΙΡΙΔΙΟ, ΜΕΤΑ ΤΑ ΕΡΩΤΗΜΑΤΑ ΤΟΥ ΜΑΝΟΥΗΛ ΧΡΥΣΟΛΩΡΑ, που συντάχθηκε από Eλληνα με σκοπό να σπουδάσουν την ελληνική γλώσσα οι Δυτικοί. Ο Λάσκαρης εγκατέλειψε τη γενέτειρά του την Κωνσταντινούπολη πριν από την Πτώση και εγκαταστάθηκε στο Μιλάνο μετά το 1460, όπου δίδαξε ελληνικά για έξι περίπου χρόνια. Συνέταξε τη Γραμματική του για λογαριασμό της κόρης του δούκα του Μιλάνου Francesco Sforza, Ιππολύτης, ηλικίας μόλις δεκαπέντε ετών, μέλλουσας νύφης του βασιλιά της Νεάπολης Αλφόνσου. Η Γραμματική του Λάσκαρη ολοκληρώθηκε τυπογραφικά το 1476 και ανοίγει με πρόλογο του Δαμιλά προς τους αναγνώστες, στον οποίο γίνεται λόγος για τη χρησιμότητα του εγχειριδίου σε όσους επιθυμούν να σπουδάσουν την ελληνική γλώσσα και τα ελληνικά γράμματα.'''


textBox(TestText, (30, -10, 227, height()))

fontSize(14)
lineHeight(16)


textBox(TestText, (300, height()/2-4, 500, height()/2))

fontSize(20)
lineHeight(23)

textBox(TestText, (300, height()/2-250, 500, 250))   

fill(0.5)
fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170702 / TestPrintDoc170702 / Sample text: From TestDocs_IV / p4|4 ", (30, 10, width(), 30), align="left")

saveImage("TestPrintDoc170702.pdf")
