# For DrawBot 
# Use it with these files installed:
# Eczar-ExtraBold_170605_v01.ufo, Eczar Regular_170610_v02, Eczar Regular_170610_v03

size("A4Landscape")
fontSize(10)
lineHeight(12)
font("Eczar Regular_170606_v01")

TestText = '''
Ομορά οία, μια ρε άρμα! Μόριο ιοί ει ειμή ο «Αμέ ρε ιέρει, ερμάριο ορέ», όροι. Ερμάρια ράμμα μαία. Ρέει έρημο ιέρεια, ερμάρια, όμοιο ορμάει; Ερημοι αέρια ροή, όρο άρε ερημιά. Νάραμα αίμα, Χίο, Κάρρο με ορρό Αμάρα Eρήμη. €678.120, Καρμιό αέριε. 30 Χέρια μέρει Τάμε ο αέρι ορρέ, Joë Bousquet & Benoît de Sainte-Maure! Χόρια μέρει, άμοιρα ή άμοιροι. Κάρμα μιαρά ραμί, Υράμε όμοιο έρμοι μα ραμί ιό μοιραίο μη άρμα. Η Ηρά Ζει ΚΑΤ; Μοιραία Ιαρίμη μόρια άμε «Ομήρεια, άμοιρο Ρήμα», ορά ρίμαρα...

Νέρει άμοιρη έρεε ή μέρει 29,35 μαρμαρά Μαμά! «Αέριοι ‘όροι όμοια’ Ρίμαρα μια έρμαια όμορα». Ταρμαρά έρημη ροί οι ρέει ομήρεια όμοιοι ίο μαία ΜΙΤ, μάρμαρο ιερό μηροί ήρεμο. ΕΡΗΜΑ ΕΙΝΑΙ! Ειμή Ηρμά οία ορέ Ηραίο άρμη ρέε ιερό ομήρεια. Ερμάριο, μιαρά, ορμή, αέρια, μια η ρη. «This is not how adhension works dude!» Χίμαιρα, Κορη μίμερο, άμμοι. Ορό ή οι έρμοι όμοιοι, ρε ροιάμη όρια αρμό μία μάρμαρα. Ρε! Μη! Εαρηρμά μίμε όρμο έαρ. Με ομοιό ήρεμε. Τα είμαι ή μοιραία, άμοιρη. Το ιερό άρα με άμοιρη ήμερα, «αμέ αρμέ ή μέρει οι μάρμαρα. Ορμάει έρμα αέρα ή ρέμα;»

Η ορά ήρεμοι μια άμα ή αέριε όρια. Αίμα μάρρο αραιή άρε, άμοιρα μάρμαρο! 80 μορεία άμε, 6033,77 ρε. Ζοή μόρο εμεί μοιραία έρμαια έρημη άμε. ΟΜΟΙΑ ΚΑΙ ΕΡΜΑ ΖΕΙ. Ρήμα ή ορμά; There is not? Shocking! Ορμάει ήρεμα έρμο ρε ορά ή ρέμα, μόρια. Το αίμα είμα, ομήρεια μηρέ ερμάρια! Κάρμαρα, 19 μέρα, 20 ορρά ή 34 ήρεμα ρήμα.
'''

textBox(TestText, (30, -10, 227, height()))
fill(0.5)
textBox("Eczar_v01", (30, -500, 227, height()))  
fill(0)


font("Eczar Regular_170610_v02")

TestText = '''
Ομορά οία, μια ρε άρμα! Μόριο ιοί ει ειμή ο «Αμέ ρε ιέρει, ερμάριο ορέ», όροι. Ερμάρια ράμμα μαία. Ρέει έρημο ιέρεια, ερμάρια, όμοιο ορμάει; Ερημοι αέρια ροή, όρο άρε ερημιά. Νάραμα αίμα, Χίο, Κάρρο με ορρό Αμάρα Eρήμη. €678.120, Καρμιό αέριε. 30 Χέρια μέρει Τάμε ο αέρι ορρέ, Joë Bousquet & Benoît de Sainte-Maure! Χόρια μέρει, άμοιρα ή άμοιροι. Κάρμα μιαρά ραμί, Υράμε όμοιο έρμοι μα ραμί ιό μοιραίο μη άρμα. Η Ηρά Ζει ΚΑΤ; Μοιραία Ιαρίμη μόρια άμε «Ομήρεια, άμοιρο Ρήμα», ορά ρίμαρα...

Νέρει άμοιρη έρεε ή μέρει 29,35 μαρμαρά Μαμά! «Αέριοι ‘όροι όμοια’ Ρίμαρα μια έρμαια όμορα». Ταρμαρά έρημη ροί οι ρέει ομήρεια όμοιοι ίο μαία ΜΙΤ, μάρμαρο ιερό μηροί ήρεμο. ΕΡΗΜΑ ΕΙΝΑΙ! Ειμή Ηρμά οία ορέ Ηραίο άρμη ρέε ιερό ομήρεια. Ερμάριο, μιαρά, ορμή, αέρια, μια η ρη. «This is not how adhension works dude!» Χίμαιρα, Κορη μίμερο, άμμοι. Ορό ή οι έρμοι όμοιοι, ρε ροιάμη όρια αρμό μία μάρμαρα. Ρε! Μη! Εαρηρμά μίμε όρμο έαρ. Με ομοιό ήρεμε. Τα είμαι ή μοιραία, άμοιρη. Το ιερό άρα με άμοιρη ήμερα, «αμέ αρμέ ή μέρει οι μάρμαρα. Ορμάει έρμα αέρα ή ρέμα;»

Η ορά ήρεμοι μια άμα ή αέριε όρια. Αίμα μάρρο αραιή άρε, άμοιρα μάρμαρο! 80 μορεία άμε, 6033,77 ρε. Ζοή μόρο εμεί μοιραία έρμαια έρημη άμε. ΟΜΟΙΑ ΚΑΙ ΕΡΜΑ ΖΕΙ. Ρήμα ή ορμά; There is not? Shocking! Ορμάει ήρεμα έρμο ρε ορά ή ρέμα, μόρια. Το αίμα είμα, ομήρεια μηρέ ερμάρια! Κάρμαρα, 19 μέρα, 20 ορρά ή 34 ήρεμα ρήμα.
'''

textBox(TestText, (300, -10, 227, height()))
fill(0.5)
textBox("Eczar_v02", (300, -500, 227, height()))  
fill(0)

font("Eczar Regular_170610_v03")

TestText = '''
Ομορά οία, μια ρε άρμα! Μόριο ιοί ει ειμή ο «Αμέ ρε ιέρει, ερμάριο ορέ», όροι. Ερμάρια ράμμα μαία. Ρέει έρημο ιέρεια, ερμάρια, όμοιο ορμάει; Ερημοι αέρια ροή, όρο άρε ερημιά. Νάραμα αίμα, Χίο, Κάρρο με ορρό Αμάρα Eρήμη. €678.120, Καρμιό αέριε. 30 Χέρια μέρει Τάμε ο αέρι ορρέ, Joë Bousquet & Benoît de Sainte-Maure! Χόρια μέρει, άμοιρα ή άμοιροι. Κάρμα μιαρά ραμί, Υράμε όμοιο έρμοι μα ραμί ιό μοιραίο μη άρμα. Η Ηρά Ζει ΚΑΤ; Μοιραία Ιαρίμη μόρια άμε «Ομήρεια, άμοιρο Ρήμα», ορά ρίμαρα...

Νέρει άμοιρη έρεε ή μέρει 29,35 μαρμαρά Μαμά! «Αέριοι ‘όροι όμοια’ Ρίμαρα μια έρμαια όμορα». Ταρμαρά έρημη ροί οι ρέει ομήρεια όμοιοι ίο μαία ΜΙΤ, μάρμαρο ιερό μηροί ήρεμο. ΕΡΗΜΑ ΕΙΝΑΙ! Ειμή Ηρμά οία ορέ Ηραίο άρμη ρέε ιερό ομήρεια. Ερμάριο, μιαρά, ορμή, αέρια, μια η ρη. «This is not how adhension works dude!» Χίμαιρα, Κορη μίμερο, άμμοι. Ορό ή οι έρμοι όμοιοι, ρε ροιάμη όρια αρμό μία μάρμαρα. Ρε! Μη! Εαρηρμά μίμε όρμο έαρ. Με ομοιό ήρεμε. Τα είμαι ή μοιραία, άμοιρη. Το ιερό άρα με άμοιρη ήμερα, «αμέ αρμέ ή μέρει οι μάρμαρα. Ορμάει έρμα αέρα ή ρέμα;»

Η ορά ήρεμοι μια άμα ή αέριε όρια. Αίμα μάρρο αραιή άρε, άμοιρα μάρμαρο! 80 μορεία άμε, 6033,77 ρε. Ζοή μόρο εμεί μοιραία έρμαια έρημη άμε. ΟΜΟΙΑ ΚΑΙ ΕΡΜΑ ΖΕΙ. Ρήμα ή ορμά; There is not? Shocking! Ορμάει ήρεμα έρμο ρε ορά ή ρέμα, μόρια. Το αίμα είμα, ομήρεια μηρέ ερμάρια! Κάρμαρα, 19 μέρα, 20 ορρά ή 34 ήρεμα ρήμα.
'''

textBox(TestText, (570, -10, 227, height()))   
fill(0.5)
textBox("Eczar_v03", (570, -500, 227, height()))  

fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar GR v01_v02_v03 / TestPrintDoc170614 ", (30, 0, width(), 30), align="left")

saveImage("TestPrintDoc170614.pdf")
