# For DrawBot 
# Use it with these files installed:
# Eczar-ExtraBold_170620.ufo
size("A4Landscape")
font("Eczar Regular_170620")

fontSize(130)
tracking(20)
textBox("αάβγδεέζηήθιίκλμνοόπρστς", (30, -30, width()-100, height()))

fill(0.5)
fontSize(9)
tracking(0)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170620 / TestPrintDoc170620 / p1|2", (30, 10, width(), 30), align="left")

newPage("A4Landscape")

font("Eczar Regular_170620")
lineHeight(12)
language("Greek")
hyphenation(True)

TestText = '''
Με πραγματικά παρεμβατικά εντομοκτόνα να δεσπόζει, νερά ή αθέατα κάδρα. Ηγέρθησαν δάση και τζαζ ίσκιοι άρτιοι, ίλιγγοι, γόνατα ήπια μελή ή πεπτίδια. Αλμανάκ θρεπτικά! Ντίβα €678.120 Ισκιο τα εκθέματά, αιτιότητες κομπίνας ή οικισμοί; Οία και Ρίνα, πάς βαρετά παραμέληση απ’ τα έντερα. Joë Bousquet & Benoît de Sainte-Maure, θεσπίζονται! Μάπες τα βαπόρια, ποιμαντικά ή εμάς; «Να ενίστανται καθημερινά, κάτσε με λάβαρα σταματημένος», ή καθαριστήρια; Το ροζέ κρασί στο τζιπ βλαστάει και μπορεί. Τι διαταράσσονται; Καταθέσεις και εστίαση, κολονάκι τής θάλασσας και το άθλημα, εγκαλείται θεία και τάπας.

Χορός διαποτιστεί, λένε παραθαλάσσια, με οργισμένη την άργησε. Είπε στον μπεζ πλανήτη, πόστο πολλές, είπα και αρτιότητα ήρε δίκαια. Μπέρκα, πίστα, δότριας, ζημιά και ζήλια, με όρο ή οπτικές παθήσεις; Αλλάζει η αβεβαιότητα. Αιτία; Οι νάρκες και με πήγες, ένα θετή, μία, μα ποια; Ομαδικά αποικήθηκαν. Το πιεσόμετρο και η γοργή γοργόνα, μια νοερή λέει: «Ορό με θέα και τανκ από το παράθηρο». ΕΡΗΜΑ ΕΙΝΑΙ τα 29,35 μάρμαρα! Το κόλον με ή απ’ της τρίμηνης γάτας με πράσινη μέντα... Ακρότερα τετηγμένη ο ποιητής Michel Houellebecq ή ο Antoine Héroët; Η γη πήγε στον απότοκο, μπα δεν τέρπνει αποθετήριο η βάση, λέει!

Ανατέλλει δριμιά με τις μέλισσες και δεν πάνε. Ελεγμένη βαλβίδα, βαθιάς εκδίκησης και τελετής ζεις. Ιστορία σικ λέει. Ζαριανά στην ενορία με τον παπά! Με τον άσσο εμάς τι να μας κάνει ο ήλιος; Κατασπατάλησαν όλες τις μονάδες. Ομαλέ για θέσε πια μετρολογία! Κέντρα 20 ή 34, 19 ή 73,21 με πάριο και οι εμπαιγμένοι ποιητές εκεί καταπιέσον, άθολα, δεινά και μακρινό το έαρ δεν το είδε. 
'''


textBox(TestText, (30, -10, 227, height()))

fontSize(14)
lineHeight(16)


textBox(TestText, (300, height()/2-4, 500, height()/2))

fontSize(20)
lineHeight(23)

textBox(TestText, (300, height()/2-250, 500, 250))   

fill(0.5)
fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170620 / TestPrintDoc170620 / p2|2 ", (30, 10, width(), 30), align="left")

saveImage("TestPrintDoc170620.pdf")
