# For DrawBot 
# Use it with these files installed:
# Eczar-Regular_170716 & Eczar-ExtraBold_170716.ufo

size("A4Landscape")
font("Eczar ExtraBold_170716")

fontSize(100)
tracking(20)
textBox("αάβγδεέζηήθιΐίϊκλμνξοόπρςστυΰϋύφχψωώ", (30, -30, width()-100, height()))

font("Eczar Regular_170716")
fill(0.5)
fontSize(9)
tracking(0)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_ExtraBold_170716 / TestPrintDoc170716 / p1|2", (30, 10, width(), 30), align="left")

newPage("A4Landscape")

language("Greek")
hyphenation(True)

font("Eczar ExtraBold_170716")
lineHeight(12)

t = '''
Ο δημήτριος δαμιλας υπήρξε από τους σημαντικότερους πρωτεργάτες της ελληνικής τυπογραφίας και το πρώτο ελληνικό χρονολογημένο βιβλίο τυπώθηκε με τη δική του επιστασία. γεννήθηκε στην κρήτη, αδελφός του κωδικογράφου και νοτάριου του Χάνδακα Αντωνίου, αναφέρεται ως «δημήτριος ο Κρης», ωστόσο οι γονείς του κατάγονταν από το Μιλάνο. δεν γνωρίζουμε τίποτα σχετικά με την παιδεία και τους δασκάλους του, παρά μόνο ότι εξάσκησε στην Ιταλία, παράλληλα με τις τυπογραφικές του δραστηριότητες και την κωδικογραφία. Η διατριβή του δαμιλά στα ιταλικά πνευματικά κέντρα αρχίζει στη γενέτειρα της οικογένειας του το Μιλάνο (π. 1475- πριν από το 1484), ενώ στη συνέχεια εγκαθίσταται στη φλωρεντία ως περίπου το 1490 και από τότε τον βρίσκουμε στη Ρώμη όπου ίσως ζούσε ακόμη το 1510. στο Μιλάνο, αρχικά, συνεργάσθηκε με τον Ιταλό Dionigi Parravicino για την έκδοση της Επιτομής των οκτώ του λόγου μερών του Κωνσταντίνου Λάσκαρη. Η γραμματική του Κωνσταντίνου Λάσκαρη είναι το δεύτερο γραμματικό εγχειρίδιο, μετά τα Ερωτήματα του Μανουήλ Χρυσολωρά, που συντάχθηκε από Eλληνα με σκοπό να σπουδάσουν την ελληνική γλώσσα οι δυτικοί. Ο Λάσκαρης εγκατέλειψε τη γενέτειρά του την Κωνσταντινούπολη πριν από την πτώση και εγκαταστάθηκε στο Μιλάνο μετά το 1460, όπου δίδαξε ελληνικά για έξι περίπου χρόνια. συνέταξε τη γραμματική του για λογαριασμό της κόρης του δούκα του Μιλάνου Francesco Sforza, Ιππολύτης, ηλικίας μόλις δεκαπέντε ετών, μέλλουσας νύφης του βασιλιά της Νεάπολης Αλφόνσου. Η γραμματική του Λάσκαρη ολοκληρώθηκε τυπογραφικά το 1476 και ανοίγει με πρόλογο του Δαμιλά προς τους αναγνώστες, στον οποίο γίνεται λόγος για τη'''


while len(t):
    font("Eczar ExtraBold_170716")
    t= textBox(t, (30, height()/2-4, 227, height()/2))
    font("Eczar Regular_170716")
    t= textBox(t, (30, height()/2-101, 227, 100))
    font("Eczar ExtraBold_170716")
    t= textBox(t, (30, height()/2-249, 227, 150))

t = '''
Ο δημήτριος δαμιλας υπήρξε από τους σημαντικότερους πρωτεργάτες της ελληνικής τυπογραφίας και το πρώτο ελληνικό χρονολογημένο βιβλίο τυπώθηκε με τη δική του επιστασία. γεννήθηκε στην κρήτη, αδελφός του κωδικογράφου και νοτάριου του Χάνδακα Αντωνίου, αναφέρεται ως «δημήτριος ο Κρης», ωστόσο οι γονείς του κατάγονταν από το Μιλάνο. δεν γνωρίζουμε τίποτα σχετικά με την παιδεία και τους δασκάλους του, παρά μόνο ότι εξάσκησε στην Ιταλία, παράλληλα με τις τυπογραφικές του δραστηριότητες και την κωδικογραφία. Η διατριβή του δαμιλά στα ιταλικά πνευματικά κέντρα αρχίζει στη γενέτειρα της οικογένειας του το Μιλάνο (π. 1475- πριν από το 1484), ενώ στη συνέχεια εγκαθίσταται στη φλωρεντία ως περίπου το 1490 και από τότε τον βρίσκουμε στη Ρώμη όπου ίσως ζούσε ακόμη το 1510. στο Μιλάνο, αρχικά, συνεργάσθηκε με τον Ιταλό Dionigi Parravicino για την έκδοση της Επιτομής των οκτώ του λόγου μερών του Κωνσταντίνου Λάσκαρη. Η γραμματική του Κωνσταντίνου Λάσκαρη είναι το δεύτερο γραμματικό εγχειρίδιο, μετά τα Ερωτήματα του Μανουήλ Χρυσολωρά, που συντάχθηκε από Eλληνα με σκοπό να σπουδάσουν την ελληνική γλώσσα οι δυτικοί. '''


fontSize(14)
lineHeight(16)

textBox(t, (300, height()/2-4, 500, height()/2))


fontSize(20)
lineHeight(23)

textBox(t, (300, height()/2-250, 500, 250))   

font("Eczar Regular_170716")
fill(0.5)
fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / ExtraBold & Regular_170716 / TestPrintDoc170716 / Sample text: From TestDocs_IV / p2|2 ", (30, 10, width(), 30), align="left")

saveImage("TestPrintDoc170716.pdf")
