# For DrawBot 
# Use it with these files installed:
# Eczar-ExtraBold_170625.ufo
size("A4Landscape")
font("Eczar Regular_170625")

fontSize(100)
tracking(20)
textBox("αάβγδεέζηήθιΐίϊκλμνξοόπρςστυΰϋύφχψωώ", (30, -30, width()-100, height()))

fill(0.5)
fontSize(9)
tracking(0)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170625 / TestPrintDoc17062ρ5 / p1|2", (30, 10, width(), 30), align="left")

newPage("A4Landscape")

font("Eczar Regular_170625")
lineHeight(12)
language("Greek")
hyphenation(True)

TestText = '''
Μισοπλαγιασμένη κοντά εις την εστίαν, με σφαλιστά τα όμματα, την κεφαλήν ακουμβώσα εις το κράσπεδον της εστίας, το λεγόμενον «φουγοπόδαρο», η θεια-Χαδούλα, η κοινώς γιαννού η φράγκισσα, δεν εκοιμάτο, αλλ’ εθυσίαζε τον ύπνο πλησίον εις το λίκνον της ασθενούσης μικράς εγγονής της. Όσον διά την λεχώ, την μητέρα του πάσχοντος βρέφους, αύτη προ ολίγου είχεν αποκοιμηθή επί της χθαμαλής, πενιχράς κλίνης της. Ο μικρός λύχνος, κρεμαστός, ετρεμόσβηνε κάτω του φατνώματος της εστίας. Έρριπτε σκιάν αντί φωτός εις τα ολίγα πενιχρά έπιπλα, τα οποία εφαίνοντο καθαριώτερα και κοσμιώτερα την νύκτα. Οι τρεις μισοκαυμένοι δαυλοί, και το μέγα ορθόν κούτσουρον της εστίας, έρριπτον πολλήν στάκτην, ολίγην ανθρακιάν και σπανίως βρέμουσαν φλόγα, κάμνουσαν την γραίαν να ενθυμήται μέσα εις την νύσταν της την απούσαν μικροτέραν κόρην της, την Κρινιώ, ήτις αν ευρίσκετο τώρα εντός του δωματίου, θα υπεψιθύριζε με τόνον λογαοιδικόν: «Αν είναι φίλος, να χαρή, αν είν’ εχθρός, να σκάση...» Η Χαδούλα, η λεγομένη φράγκισσα, ή άλλως φραγκογιαννού, ήτο γυνή σχεδόν εξηκοντούτις, καλοκαμωμένη, με αδρούς χαρακτήρας, με ήθος ανδρικόν, και με δύο μικράς άκρας μύστακος άνω των χειλέων της. Εις τους λογισμούς της, συγκεφαλαιούσα όλην την ζωήν της, έβλεπεν ότι ποτέ δεν είχε κάμει άλλο τίποτε ειμή να υπηρετή τους άλλους. Όταν ήτο παιδίσκη, υπηρέτει τους γονείς της. Όταν υπανδρεύθη, έγινε σκλάβα του συζύγου της – και όμως, ως εκ του χαρακτήρος της και της αδυναμίας εκείνου, ήτο συγχρόνως και κηδεμών αυτού· όταν απέκτησε τέκνα, έγινε δούλα των τέκνων της· όταν τα τέκνα της απέκτησαν τέκνα, έγινε πάλιν δουλεύτρια των εγγόνων της. Το νεογνόν είχε γεννηθή προ δύο εβδομάδων. Η μητέρα'''


textBox(TestText, (30, -10, 227, height()))

fontSize(14)
lineHeight(16)


textBox(TestText, (300, height()/2-4, 500, height()/2))

fontSize(20)
lineHeight(23)

textBox(TestText, (300, height()/2-250, 500, 250))   

fill(0.5)
fontSize(9)
textBox("Emilios Theofanous / GSoC17 - Adding Greek to the Open-Source Type Family Eczar / Eczar_Regular_170625 / TestPrintDoc170625 / Sample text: “The murderess” - A. Papadiamantis / p2|2 ", (30, 10, width(), 30), align="left")

saveImage("TestPrintDoc170625.pdf")
